a = 10

alert(a)

a = 20

alert(a)
//////////////////////////////
const firstiPhone = 2007

alert(`Выход первого айфона ${firstiPhone}`)
//////////////////////////////
const name = "Brendan Eich"

alert(`имя создателя языка JavaScript ${name}`)
//////////////////////////////
a = 10
b = 2

alert(`Сумма ${a + b}`)
alert(`Разность ${a - b}`)
alert(`Произведение ${a * b}`)
alert(`Частность ${a / b}`)
//////////////////////////////
a = 2
b = 5

result = 2 ** 5

alert(`Результат возведения 2 в 5-ю степень = ${result}`)
//////////////////////////////
a = 9
b = 2

result = 9 % 2

alert(`Остаток от деления 9 на 2 = ${result}`)
//////////////////////////////
let num = 1;

num += 5;
num -= 3;
num *= 7;
num /= 3;
num ++ ;
num --;

alert(num);
//////////////////////////////
let age = prompt('Сколько вам лет?');

alert(age);